import 'package:gita_apps/Model/details.dart';

//Home Page Slider Images....
class Utils {
  static List<Details> getMokedDetails() {
    return [
      Details(
        imgName: "images/2.jpg",
      ),
      Details(
        imgName: "images/k.jpg",
      ),
      Details(
        imgName: "images/3.jpg",
      ),
      Details(
        imgName: "images/4.jpg",
      ),
      // Details(
      //   imgName: "images/7.jpg",
      // ),
      Details(
        imgName: "images/arjun.jpg",
      ),
    ];
  }
}

//Gitar Amrito Bani Page data......
class Utils2 {
  static List<Details2> getMokedDetails() {
    return [
      Details2(
        title: "- ভগবান শ্রীকৃষ্ণ ",
        detailss:
            "সমুদ্র হৌক কিংবা সংসার যে ধর্মের নৌকা প্রস্তুত করে সে ঠিক পার হয়ে যায়।",
      ),
      Details2(
        title: "- ভগবান শ্রীকৃষ্ণ ",
        detailss:
            "যখন সংসারে দেখার মতো কিছুই থাকে না, তখন মানুষ ঈশ্বর এর দিকে দৃষ্টি পাত করে।",
      ),
      Details2(
        title: "- ভগবান শ্রীকৃষ্ণ ",
        detailss:
            "যদি কোনো ঘটনায় মানুষ ভয়-প্রাপ্ত হয় তবে তার পরাজয় নিশ্চিত। অপরদিকে যে মানুষ সব হারিয়েও শান্ত আর একাগ্র থাকে সে ই জয়ী।",
      ),
      Details2(
        title: "- ভগবান শ্রীকৃষ্ণ ",
        detailss:
            "বাস্তবে না পরিচয় মানুষের দেহের সাথে যুক্ত থাকে আর না তো সম্পর্কের ভিত্তি তার দেহের সাথে যুক্ত থাকে। মানুষের স্বভাব, আচরন আর তার কার্যই তার প্রকৃত পরিচয়।",
      ),
      Details2(
        title: "- ভগবান শ্রীকৃষ্ণ ",
        detailss:
            "দান তাকেই বলে যাতে করে দানী হারায় আর যাচক প্রাপ্তি লাভ করে। কিন্তু বলীদান সেটাই হয় যা দানী দেয় আর সমগ্র জগত প্রাপ্ত করে।",
      ),
      Details2(
        title: "- ভগবান শ্রীকৃষ্ণ ",
        detailss:
            "সুখের কামনা যে করে তার সুখ লাভ হয় না, যে সুখ চিনতে পারে তারই সুখ লাভ হয়। তুমি যদি এটা জেনে যাও যে তোমার জন্য সুখ কি, তবে তুমি সুখ অবশ্যই পাবে।",
      ),
      Details2(
        title: "- ভগবান শ্রীকৃষ্ণ ",
        detailss:
            "সময় কখনো মানুষের নির্দেশিত পথে চলে না, মানুষকে সময়ের নির্দেশিত পথে চলতে হয়।",
      ),
      Details2(
        title: "- ভগবান শ্রীকৃষ্ণ ",
        detailss:
            "বিরোধীতা শক্তির প্রমাণ হয় না। শক্তিমান সেই যে সহনশীল, সহ্য করতে পারে। যখন হৃদয় থেকে ক্রোধ আর বিরোধীতা দূর হয়ে যায়, তখন সহনশক্তি ধর্মের শক্তিতে পরিনত হয়। ক্রোধ থেকে প্রতিশোধের জন্ম হয় আর ধর্ম থেকে ন্যায় জন্মায়। তোমার জীবনেও যদি এমন সময় আসে্‌, যখন তোমার উপর কোনো অন্যায় হয় তবে ন্যায় করার পূর্বে নিজের ক্রোধের উপর অঙ্কুশ অবশ্যই রেখো।",
      ),
      Details2(
        title: "- ভগবান শ্রীকৃষ্ণ ",
        detailss:
            "যে বৃক্ষ তিক্ত-ফন দান করে সে বৃক্ষকে উৎপাটন করে মধুর ফল প্রদানকারী বৃক্ষকে রোপন করতে হয়। ঐ বৃক্ষকেই অধিক খাদ্য গ্রহন করিয়ে / শাখা-প্রশাখাকে কাট-ছাট করলে মধুর ফল পাওয়া যায় না। ভবিষ্যৎকে শুদ্ধ করার জন্য এই অশুদ্ধ বর্তমানকে ধ্বংস করা অনিবার্য। ভবিষ্যতের ঊদীয়মান সূর্যের প্রথম কিরণকে দেখো। যা সয়াব্র জন্য প্রতিক্ষা করছে।",
      ),
      Details2(
        title: "- ভগবান শ্রীকৃষ্ণ ",
        detailss:
            "প্রেম উন্নতি দেয়, উচিৎ অনিচিতের জ্ঞান দেয় প্রেম আর মোহের মাঝে পার্থক্য থাকে। বাস্তবে যা প্রেম, তা কোনো মোহ নয়। প্রেমের জন্ম করুণা থেকে হয়, আর মোহের জন্ম অহংকার থেকে। প্রেম মুক্তি দেয়, আর মোহ অধর্ম।",
      ),
      Details2(
        title: "- ভগবান শ্রীকৃষ্ণ ",
        detailss:
            "মানুষের সব সম্পর্কের আঁধার হলো প্রত্যাশা। পতি কেমন হবে- যে আমার জীবন সুখ আর সুবিধায় ভরে দিবে। পত্নী কেমন হবে- যে সর্বদা আমার প্রতি সমর্পিত থাকবে। সন্তান কেমন হবে- যে আমার সেবা করবে, আমার আদেশ মেনে চলবে। মানুষ প্রেম তাকেই দিতে পারে, যে কিনা আর প্রত্যাশা পূরণ করতে পারে। আর প্রত্যাশার নিয়তিই হচ্ছে ভঙ্গ হওয়া। কিভাবে? কারণ- প্রবল ইচ্ছা থাকলেও কোনো মানুষ কারোর সকল ইচ্ছা পূর্ন করতে পারেনা। আর তার থেকেই জন্ম নেয় সংঘর্ষ। সকল সম্পর্ক সংঘর্ষে পরিবর্তিত হয়ে যায়। কিন্তু মানুষ যদি প্রত্যাশাকে সম্পর্কের আধার না বানায়, আর স্বীকার করে যে, কেবল সম্পর্কই মূল আধার। তবে কি জীবন আপনা থেকেই সুখ আর শান্তিতে ভরে যাবে না ! স্বয়ং বিচার করে দেখুন",
      ),
      // Details2(
      //   title: "- ভগবান শ্রীকৃষ্ণ ",
      //   detailss: " ।",
      // ),
      // Details2(
      //   title: "- ভগবান শ্রীকৃষ্ণ ",
      //   detailss: " ।",
      // ),
      // Details2(
      //   title: "- ভগবান শ্রীকৃষ্ণ ",
      //   detailss: " ।",
      // ),
      // Details2(
      //   title: "- ভগবান শ্রীকৃষ্ণ ",
      //   detailss: " ।",
      // ),
      // Details2(
      //   title: "- ভগবান শ্রীকৃষ্ণ ",
      //   detailss: " ।",
      // ),
    ];
  }
}

//18 nam & MAhotto....
class Utils3 {
  static List<Details3> getMokedDetails() {
    return [
      Details3(
        name: "গীতার ১৮ নাম",
        nameDetails:
            "১. গঙ্গা,  ২. গীতা, ৩. সাবিত্রী, ৪. সীতা, ৫. সত্ত্বা, ৬. প্রতিব্রতা, ৭. ব্রক্ষ্মাবলি, ৮. ব্রক্ষ্মবিদ্যা, ৯. ত্রিসন্ধ্যা, ১০. মুক্তিগেহেনী, ১১. অর্ধ-ম্ত্রা, ১২. চিদানন্দা, ১৩. ভবগ্নী, ১৪. ভ্রান্তিনাশিনী, ১৫. বেদত্রয়ী, ১৬. পরানন্দা, ১৭. তথাস্তু, ১৮. জ্ঞান্-মঞ্জুরী",
      ),
      Details3(
        name: "গঙ্গা",
        nameDetails:
            "এর অর্থ হল গঙ্গায় ডুবলে কোন ব্যক্তি তার সকল পাপ নাশ করতে পারে তাই সবার প্রথমে গঙ্গার নাম নেওয়া হয়।",
      ),
      Details3(
        name: "গীতা",
        nameDetails:
            "যে ব্যক্তি গীতা পাঠ করেন সেই মুহূর্তে তার সকল পাপ না হয়। তাই এখানে গীতার কথা বলা হয়েছে।",
      ),
      Details3(
        name: "সাবিত্রী",
        nameDetails:
            "তিনি এতটাই সতী ছিল যে,সে তার মৃত স্বামীর প্রাণ ফিরিয়ে এনেছিল। তাই এখানে সাবিত্রীর কথা বলা হয়েছে।",
      ),
      Details3(
        name: "সীতা",
        nameDetails:
            " ভগবান রামের স্ত্রী,মাতা সীতা এতটাই পবিত্র ছিল যে, রাবণ শত চেষ্টার পরেও তার নষ্ট করতে পারেনি, তাই সীতা নাম মহা পবিত্র বলা হয়।",
      ),
      Details3(
        name: "সত্ত্বা",
        nameDetails:
            "সত্ত্বা বলতে আমাদের আত্মার কথা বলা হয়েছে, আত্মা যেমন অমর গীতা ও তেমনি অমর।",
      ),
      Details3(
          name: "প্রতিব্রতা",
          nameDetails:
              "পতিব্রতা বলতে ভগবানের প্রতি আনুগত্য থাকা, কারণ- একমাত্র ভগবান সকলের পতি আর আমরা সকলেই তাঁর পত্নী।"),
      Details3(
        name: "ব্রক্ষ্মাবলি",
        nameDetails:
            "ব্রহ্মশক্তি থেকে নির্গত শক্তি কে বলা হয় ব্রহ্মাবলী। যে শক্তির বিনাশ নেই।",
      ),
      Details3(
        name: "ব্রক্ষ্মবিদ্যা",
        nameDetails: "ব্রহ্মবিদ্যাকে আমরা ব্রহ্মাবলীর অনুরূপ বলতে পারি।",
      ),
      Details3(
        name: "ত্রিসন্ধ্যা",
        nameDetails:
            "ত্রিসন্ধ্যা মানে হলো তিন কালের সমষ্টি, যথা ইহকাল, বর্তমান কাল ও পরকাল।",
      ),
      Details3(
        name: "মুক্তিগেহেনী",
        nameDetails:
            "একমাত্র গীতা পাঠ করলেই মুক্তি পাওয়া সম্ভব, তাই এ নাম ব্যবহার করা হয়েছে।",
      ),
      Details3(
        name: "অর্ধ-ম্ত্রা",
        nameDetails:
            " গীতায় ভগবান শ্রীকৃষ্ণ বলেছেন গীতার অর্ধক তাই এই অর্থ ব্যবহার করা হয়েছে।",
      ),
      Details3(
        name: "চিতানন্দা",
        nameDetails: "চিৎ জগতের যে আনন্দ তাই চিতানন্দা।",
      ),
      Details3(
        name: "ভবগ্নী (ভব+অগ্নি)",
        nameDetails:
            "অগ্নি যেমন সোনাকে পুড়ে খাঁটি সোনায় পরিণত করে, ঠিক তেমনি গীতায় পারে আমাদের সকল পাপ দূর করতে।",
      ),
      Details3(
        name: "ভ্রান্তিনাশিনী",
        nameDetails:
            "আমরা আমাদের চারপাশের জিনিস দেখে বিভ্রান্ত হই,আর একমাত্র গীতাই পারে আমাদের এই ভ্রান্তি নাশ করতে।",
      ),
      Details3(
        name: "বেদত্রয়ী",
        nameDetails: "ত্রিবেদের সমন্বয়ে গঠিত শক্তি হলো বেদত্রই।",
      ),
      Details3(
        name: "পরানন্দা",
        nameDetails:
            "অপরের দোষ না দেখে তার ভালো দিক দেখার মধ্যে যে আনন্দ,গীতায় তার কথাই বলা হয়েছে।",
      ),
      // Details3(
      //   name: "তত্তার্থ",
      //   nameDetails: "",
      // ),
      Details3(
        name: "তথাস্তু জ্ঞানমুঞ্জুরী",
        nameDetails:
            "গীতা পৃথিবীর সকল জ্ঞান-বিজ্ঞানের আধার, তাই একে জ্ঞানমুঞ্জুরী বলা হয়।",
      ),
    ];
  }
}
























/* "গঙ্গা -- গীতা \nসাবিত্রী -- সীতা \nসত্যা -- প্রতিব্রতা \nব্রক্ষ্মাবলি -- ব্রক্ষ্মবিদ্যা \nত্রিসন্ধ্যা -- মুক্তিগেহেনী \nঅর্ধ-মাত্রা -- চিদানন্দা \nভবগ্নী -- ভ্রান্তিনাশিনী \nবেদত্রয়ী -- পরানন্দা \nতত্তার্থ -- জ্ঞান্মঞ্জুরী", */